{
    "IdUser": "rjara",
    "Groups": [
        {
            "Id": "1",
            "Name": "Hard List",
            "Words": "word1, word2"
        },
        {
            "Id": "2",
            "Name": "Easy List",
            "Words": "Name Value Come along for Acompañenos The only catch is Lo único si Rule of thumb Regla de oro A tad over Un poco más Far too soon Demasiado pronto Caveat goes Advertencia dice We're at it Estamos en eso For more that Por más que Second thought Pensándolo bien That very hour En ese mismo instante Without going further. Sin ir más lejos Just one left Solo queda uno Blaze the trail Abrir el camino To expedite Acelerar It took me a while Me tomo un rato I find it interesting Me parece interesante off the grid Fuera del mapa Bunch of stuff Montón de cosas Going on Sucediendo/pasando I gotta do Tengo que hacer Would have been Habría sido Write down Anotar What has become of? Que ha sido? Does that work for you? Funciona para ti? I'm serious En serio gotta go Tengo que irme Totally unrelated Nada que ver It is catching on Se está poniendo al día cheer you up Animarte Get tied up Quedar atado You won't regret it No te arrepentirás Halfway Mitad de camino I'll make it up to you Lo haré por ti Pick the day Eligir el día Blow your mine Volar tu cabeza You have got to start Tienes que empezar Just a little furhter Solo un poco más lejos Couple bucks Unos dolares run out of Quedar sin He goes out the window El sale por la ventana Briefly Brevemente De facto De facto If i had Si tuviera Pain points Puntos debiles I can give my best try Puedo dar mi mejor intento I'll do my best Haré mi mejor esfuerzo It happens to me Me pasa We'll keep on Seguiremos Throughout A lo largo de Properly Apropiadamente We're getting close Nos estamos acercando I hope I was clear Espero haber sido claro Have you gotten..? Has conseguido? As per Según Stale items Items obsoletos I'm all done Tengo todo listo It was the one that Fue el que I have been working He estado trabajando I was working Estuve trabajando My friends have passed the test. mis amigos han pasado el test I have just fed the rabbits. Acabo de dar de comer a los conejos I just fed the rabbits. Acabo de dar de comer a los conejos He has already invited his friends. Ya ha invitado a sus amigos I was at the pet shop Estuve en la tienda de mascotas Marcus has had an accident Marcus ha tenido un accidente Emily has painted her room Emily ha pintado su habitación I have just cleaned my bike Acabo de limpiar mi bicicleta Has Sophie prepared the talk in history yet Ha Sophie preparado ya la charla de historia? Why haven't you checked the tyres yet Por qué no has revisado los neumáticos todavía I was looking for a book that had good reviews Estaba buscando un libro que tuviera buenas críticas She asked me if I had learned the new words Ella me preguntó si había aprendido las nuevas palabras Jack had fed his hamster before he left his house Jack había alimentado a su hámster antes de que saliera de su casa Jack had fed his hamster before he left his house Jack había alimentado a su hámster antes de que saliera de su casa It had not rained for three weeks No había llovido durante tres semanas It surprised me that you had gone to Peru Me sorprendio que hubieras ido a Perú I hoped that you had eaten Esperaba que hubieras comido If only he had arrived on time Ojalá el hubiera llegado a tiempo If only he had arrived on time Si tan solo hubiera llegado a tiempo If they had gone on vacation, they would have bought gifts for us Si hubieran ido de vacaciones, nos habrían comprado regalos I doubted that he was coming Dudaba que el viniera I'm looking for a book that has gotten good reviews Busco un libro que haya obtenido buenas críticas I am happy that you have come Me alegro de que hayas venido who had come with her Quien había venido con ella He has been working four days Ha estado trabajando por 4 dias Didn't I tell you No te dije? Didn't I tell you? No te dije? Keep us posted how we can wrap this up Manténganos informados sobre cómo podemos concluir esto wrap this up acabar con esto given our preference for dada nuestra preferencia por Anne will have repaired her bike next week Anne habrá reparado su bicicleta la próxima semana Do you think there is a problem in? Crees que exista un problema en? Is playing in Se está produciendo Tony hasn't been reading his book, but Mary has Tony no ha estado leyendo su libro, pero Mary sí. the thing has gone too far las cosas han ido demasiado lejos I didn’t think I’d go into no pense que entraria What do the colors on the.. ? Que indican los colores en..? the card attempted to be added la tarjeta que se intento agregar don’t mind no importa What are we going to do Que vamos a hacer We have made some headway Hemos hecho algunos avances you are on your own Estas por tu propia cuenta Didn't they tell you? No te lo dijeron? Haven't they told you yet? No te lo han dicho aún? Have you already had lunch? Ya almorzaste? Have you already had lunch? Ya almorzaste? You don't have to do it No tienes que hacer esto Nobody else knows Nadie más lo sabe He doesn't have a pen El no tiene un lápiz Do you have a girlfriend? Tienes novia? It appear that most users have now been restored Parece que la mayoría de los usuarios han sido restaurados For any lingering issues, head over to Pará cualquier problema persistente diríjase a They offered to take us to the park Se ofrecieron en llevarnos al parque Yes, but none of mine are coming Si, pero ninguno de los míos vendra If your car has run out of fuel Si tu auto quedó sin gasolina It was my understanding that Tenía entendido que Instead of doing nothing En vez de que este haciendo nada What company does he work for? Para que empresa el trabaja? I'm not angry with at him at all No estoy enojado con el en absoluto If i had free time, I would play computer Si tuviera tiempo libre jugaría al computador I wouldnt buy this coat if i were you No compraría este abrigo si fuera tú You'll get usted to them Te acostumbraras a ellos Were you able to fix the pc? Pudiste arreglar el pc? My boss told me off for being late Mi jefe me regaño por llegar tarde This photography was taken last year Esta foto fue tomada el año pasado They were picked yesterday Fueron recogidos ayer We are going to cinema, aren't we? Vamos al cine, no? I have never heard of him Nunca he escuchado de el I couldn't even hear myself Ni si quiera podía oírme a mi mismo Would you mind switching off the lights please Le importaría apagar las luces por favor If i was a millionaire Si fuera millonario I would help you if you were more polite Te ayudaría si fueras mas educado I attribute my success to this Atribuyo mi éxito a esto You'll get used to this weather Te acostumbraras a este clima Have you had your lunch yet? Has almorzado ya? Has your car been fixed yet? Ha sido reparado tu auto? I thought you had gone Pensé que te habías ido I have two books, you can take etheir of them Tengo dos libros, puedes llevarte cualquiera de ellos Neither helen nor janie know programming Ni helen ni janie saben de programación Unless you tell me otherwise A menos que me digas lo contrario I been on hold for almost half an hour He estado en espera durante casi media hora Spare money Dinero extra Which one of you? Quien de ustedes? This is the third time Esta es la tercera vez Didn't I see you with him? No te vi con el? It was early moring Era temprano en la mañana Did either of you work? Alguno de ustedes trabajó? Seems to indicate otherwise Parece indicar lo contrario I'm going to be late Voy a llegar tarde How came you are so strong? Como es que eres tan fuerte? What are you good at? Para que eres bueno? If we lived in the montains Si viviéramos en las montañas They placed the body there Pusieron el cuerpo ahi There will be not loss of any No habrá pérdida de ninguna You're soon going to see Pronto veras Shortly after Poco después Dont hold back No lo retengas Even though A pesar que / aunque Like minded Mentalidad similar Have you thought of that? Lo has pensado? / has pensado en eso? What this is for? Para que sirve? I'd rather have Preferiría tener To get away with Salirse con la suya It is typical of Es propio de Our will to be free is unbeatable Nuestra voluntad de ser libres es imbatible Are slim to none Pocos o nulas No worries, I'll get by Descuida, me las arreglare Whether you like it or not Ya sea que te guste o no Nothing beats a cup of coffee Nada mejor que una taza de café Passing away Fallecimiento I got confused Me confundí That being said Dicho esto I could get used to this Podría acostumbrarme a esto Im getting used to the life in Barcelona Me estoy acostumbrando a la vida en Barcelona I was used to the life in Chile Estaba acostumbrado a la vida en Chile Since there is no answer Dado que no hay respuesta I know that is terrible timing Se que es mal momento Both the kitchen and room Tanto la cocina como la habitación Im about to end my shift in a bit, I'll try to carry on Estoy apuntó de terminar mi turno, interare continuar At the very least Por lo menos I did this on purpose Lo hice a propósito Instead of fixing it I made it worse En vez de arreglarlo lo empeore He has passed out Se ha desmayado The very reason we are in this position La misma razón por la que estamos asi Remove them all but this one Quitalos todos menos este Ignore them everything except a few files Ignora los todos menos unos pocos archivos So, having said that Entonces, dicho esto He is basing his decisions on science Esta basando sus decisiones en la ciencia Well done mate Bien hecho compañero The very words of God La mismísima palabra de Dios We agreed that once I have finished Acordamos que una vez yo haya finalizado God passed over the sins commited Dios paso por alto los pecados cometidos Retrival program Programa de recuperacion Catch you later Nos vemos luego But mine is not just boasting. Pero lo mio no es alarde Uphold Confirmar/mantener To tear apart Desgarrar/destrozar Slips of paper Tiras de papel Endurance is the key to overcoming La resistencia es la clave para superar Poured out Derramado Why a Person Feels Helpless? Porque una persona se siente impotente? What they were doing was ungodly and evil Lo que estaban haciendo era impío y maligno Most hands have a likeness to them. La mayoría de las manos tiene parecido entre ellas I would rather to avoid having to change Preferiría evitar tener que cambiar We were naive to think we could get away with this. Fuimos ingenuos en creer que podríamos librarnos de esto the felon who nearly murdered Kyle El delincuente que casi mata a Kyle Kari Lake has filed a lawsuit to Kari Lake ha presentado una ley para There are some who would not deem it wise Hay algunos quienes no lo considerarían sabio eso They have the need Tienen la necesidad The needs were covered Las necesidades fueron cubiertas I feel proud for have had the opportunity Me siento orgulloso de haber tenido la oportunidad Let no one deceive himself Que nadie se engañe It relies on a series of Se basa en una serie de Once an issue of Una vez que un problema de Allows behavior to be added to Permite que un comportamiento sea agregado a They may have minor differencies Pueden tener pequeñas diferencias. It doesn't have a default template No tiene una plantilla predeterminada as though Como si You yourself Ustedes mismos Do not be deceived No sean engañados End up being really time consuming Termina siendo realmente lento What a relief! ¡Qué alivio! There is no getting around this No hay forma de evitar esto Under the guise of Bajo la apariencia de I would rather be locked prefiero estar encerrado More or less Más o menos Getting started issue Problema inicial If things go well Si las cosas van bien Following the tradition Siguiendo la tradición you can tell they want to puedes decir que quieren This does nothing special Esto no hace nada especial First things first Lo primero es lo primero It with less clutter Con menos lio Why do i need it? ¿Por qué lo necesito? undergo Someterse Still trying to work it out Aún estoy tratando de resolverlo Just admit and move on. Sólo admítelo y sigue adelante doubled down on their efforts to ensure redoblaron sus esfuerzos para asegurar"
        }
    ]
}